'''Module for filtering words'''

armenian_symbols = ['՛','՝','՞','՜','–','―','—','֊','․','։','։']

shaghkapner = ['ու','և','եվ','ևս','էլ','նաև','այլև','մինչ','մինչդեռ','այլապես','այսինքն','բայց',
               'սակայն','իսկ','կամ','որ','թե','եթե','որպեսզի','հենց','նախքան', 'թեպետ','թեկուզ']

ojandak_bayer = ['եմ','է','ենք','եք','են','չի','չեմ','չես','չի','չենք','չեք','չեն','էի',
                 'էիր','էր','էինք','էիք','էին','չէի','չէիր','չէր','չէինք','չէիք','չէին']

kaper = ['անց','առանց','առաջ','առթիվ','առջև','բացի','դեմ','դեպի','դուրս','ըստ','կողմ','հանուն',
         'հետ','մասին','մեջ','միջև','մոտ','ներս','նման','պես','վեր','վրա','փոխարեն','բոլոր','դեն',
         'դիմաց','ընդ','հանդեպ','մինչև','ներքո','շնորհիվ','նկատմամբ','տակ','քով']

andznakan_deranun = ['ես','ինքս','մենք','ինքներս','դու','ինքդ','դուք','ինքներդ','նա','ինքը''նրանք','իրենք',
                     'իմ','ինձ','մեր','մեզ','քո','քեզ','ձեր','ձեզ','նրա','նրան','նրանց','իր','իրենց']

cucakan_deranun = ['սա','դա','այս','այդ','այն','սույն','նույն','միևնույն','մյուս','այսպես','այդպես',
                   'այնպես','այսպիսի','այդպիսի','այնպիսի','նույնպիսի','այսքան','այդքան','այնքան',
                   'նույնքան','այսչափ','այդչափ','այնչափ','նույնչափ','այստեղ','այդտեղ','այնտեղ']

harcakan_deranun = ['ով','ինչ','ինչպիսի','ինչքան','ինչպես','ինչու','որ','որը','որքան','որչափ',
                    'որպիսի','որերորդ','որտեղ','երբ','ուր','քանի','քանիսը','քանիերորդ']

voroshyal_deranun = ['ամբողջ','ամեն','բոլոր','յուրաքանչյուր','ողջ','համայն','ամենայն','ամբողջը',
                     'ամենը','ամենքը','բոլորը','յուրաքանչյուրը','ոք','ողջը']

ayl_deranun = ['իրար','միմյանց','մեկմեկու','մեկմեկի','ոչինչ','ոմն','մեկը','մեկնումեկը','մի',
               'ուրիշ','այլ','այսինչ','այնինչ','որոշ','որևէ','ովևէ','երբևէ','երբևիցե','որևիցե']
